application/modules/Custom/Interbrain/Perfect2/requestD.xml

<?xml version="1.0" encoding="UTF-8"?> 
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:ns1="http://interbrain.p2online/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <SOAP-ENV:Body>
        <ns1:ValidateOrder xsi:type="ns1:Order">
            <ns1:Items>
                <ns1:OrderPosition>
                    <ns1:Id>1</ns1:Id>
                    <ns1:Client>
                        <ns1:Id>1</ns1:Id>
                        <ns1:Typ>2</ns1:Typ>
                        <ns1:Title/>
                        <ns1:EMailAddress>a.kummer@wdrei.ch</ns1:EMailAddress>
                        <ns1:AllowsAdvertising>false</ns1:AllowsAdvertising>
                    </ns1:Client>
                    <ns1:ItemLanguage>SD</ns1:ItemLanguage>
                    <ns1:ValidFrom>2011-08-16T00:00:00+02:00</ns1:ValidFrom>
                    <ns1:ValidTo>2013-08-16T00:00:00+02:00</ns1:ValidTo>
                    <ns1:Quantity>1</ns1:Quantity>
                    <ns1:Price/>
                    <ns1:TaxAmount/>
                    <ns1:ErrorCode/>
                </ns1:OrderPosition>
            </ns1:Items>
        </ns1:ValidateOrder>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
